
#Дано целое число N. Выведите следующее за ним четное число.
A = int(input())
print(A + 2 - A % 2)
