
#Дано положительное двузначное число. Найдите число десятков в нем.
N = input()
print(N[0])
