#Дано натуральное число. Выведите его последнюю цифру.
N = input()
print(N[-1])
