# Напишите программу, которая считывает два целых числа
# A и B и выводит наибольшее значение из них.
A = int(input())
B = int(input())
if A > B:
    print(A)
else:
    print(B)
